## Requirements

In [1]:
import pandas as pd
from sqlalchemy import create_engine
# pip install psycopg2

## Connecting

In [2]:
# 'postgresql://{user}:{password}@{host}:{port}/{db}'
engine = create_engine('postgresql://root:root@localhost:5432/My_Database')
engine.connect()

## Database tables

In [3]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,madrid_houses,root,None,False,False,False,False
1,public,body_fat,root,None,False,False,False,False
2,public,Jena_climate,root,None,False,False,False,False

---
---
---

## SQL Operations

### Full view of a table

In [6]:
query = 'SELECT * FROM madrid_houses'
df = pd.read_sql(query, con=engine)
df

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1
3,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
4,4,21738,108.0,2,2,1,0.0,4,260000,False,True,True,0,True,133,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21734,21737,5,78.0,2,2,1,0.0,4,350000,False,True,True,0,True,10,2,5
21735,21738,4,96.0,2,2,1,0.0,3,425000,False,True,True,0,True,9,2,1
21736,21739,3,175.0,4,2,1,0.0,-1,680000,False,False,True,3,True,9,2,1
21737,21740,2,289.0,4,3,3,304.0,-5,695000,False,False,True,0,True,9,2,2
21738,21741,1,72.0,2,2,1,0.0,2,424000,False,True,True,7,True,3,1,1

### Limited view of a table

In [8]:
query = 'SELECT * FROM madrid_houses LIMIT 10'
df = pd.read_sql(query, con=engine)
df

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1
3,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
4,4,21738,108.0,2,2,1,0.0,4,260000,False,True,True,0,True,133,21,1
5,5,21737,126.0,4,2,1,0.0,3,195000,False,False,True,0,True,134,21,1
6,6,21736,120.0,5,2,1,0.0,1,190000,False,False,True,2,True,134,21,1
7,7,21735,125.0,3,2,1,0.0,2,198500,False,False,True,0,False,134,21,1
8,8,21734,84.0,3,2,1,0.0,2,212000,False,True,True,2,True,131,21,1
9,9,21733,85.0,2,1,1,0.0,7,131400,True,False,True,0,False,133,21,1

## Filtering

### Type I Filter

In [5]:
query = '''
SELECT sq_mt_built, n_bathrooms, buy_price 
FROM madrid_houses 
WHERE buy_price < 100000
'''

df = pd.read_sql(query, con=engine)
df

     sq_mt_built  n_bathrooms  buy_price
0           64.0            1      85000
1           64.0            1      72000
2           65.0            1      90000
3           60.0            1      94900
4           60.0            1      89900
..           ...          ...        ...
473         60.0            1      99000
474         40.0            1      99000
475         50.0            1      99900
476         37.0            1      87000
477         61.0            1      95000

[478 rows x 3 columns]

In [7]:
query = '''
SELECT sq_mt_built, n_bathrooms, buy_price 
FROM madrid_houses 
WHERE buy_price < 100000 
AND has_parking = TRUE
'''

df = pd.read_sql(query, con=engine)
df

   sq_mt_built  n_bathrooms  buy_price
0         50.0            1      99900
1         60.0            1      99999
2         40.0            1      95000
3         52.0            1      89000
4         59.0            1      61000